HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxScu_bf.h
/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.EVR33OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33OVMOD_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.EVR33UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33UVMOD_LEN (2)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.EVR33UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33UVMOD_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.EVR33UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33UVMOD_OFF (12)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.SLCK */
#define IFX_SCU_EVRMONCTRL_SLCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.SLCK */
#define IFX_SCU_EVRMONCTRL_SLCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.SLCK */
#define IFX_SCU_EVRMONCTRL_SLCK_OFF (30)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.SWDOVMOD */
#define IFX_SCU_EVRMONCTRL_SWDOVMOD_LEN (2)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.SWDOVMOD */
#define IFX_SCU_EVRMONCTRL_SWDOVMOD_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.SWDOVMOD */
#define IFX_SCU_EVRMONCTRL_SWDOVMOD_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_LEN (2)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_OFF (20)

/** \\brief  Length for Ifx_SCU_EVROSCCTRL_Bits.HPBGCLKEN */
#define IFX_SCU_EVROSCCTRL_HPBGCLKEN_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVROSCCTRL_Bits.HPBGCLKEN */
#define IFX_SCU_EVROSCCTRL_HPBGCLKEN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVROSCCTRL_Bits.HPBGCLKEN */
#define IFX_SCU_EVROSCCTRL_HPBGCLKEN_OFF (27)

/** \\brief  Length for Ifx_SCU_EVROSCCTRL_Bits.HPBGTRIM */
#define IFX_SCU_EVROSCCTRL_HPBGTRIM_LEN (7)

/** \\brief  Mask for Ifx_SCU_EVROSCCTRL_Bits.HPBGTRIM */
#define IFX_SCU_EVROSCCTRL_HPBGTRIM_MSK (0x7f)

/** \\brief  Offset for Ifx_SCU_EVROSCCTRL_Bits.HPBGTRIM */
#define IFX_SCU_EVROSCCTRL_HPBGTRIM_OFF (20)

/** \\brief  Length for Ifx_SCU_EVROSCCTRL_Bits.LCK */
#define IFX_SCU_EVROSCCTRL_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVROSCCTRL_Bits.LCK */
#define IFX_SCU_EVROSCCTRL_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVROSCCTRL_Bits.LCK */
#define IFX_SCU_EVROSCCTRL_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVROSCCTRL_Bits.OSC3V3 */
#define IFX_SCU_EVROSCCTRL_OSC3V3_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVROSCCTRL_Bits.OSC3V3 */
#define IFX_SCU_EVROSCCTRL_OSC3V3_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVROSCCTRL_Bits.OSC3V3 */
#define IFX_SCU_EVROSCCTRL_OSC3V3_OFF (28)

/** \\brief  Length for Ifx_SCU_EVROSCCTRL_Bits.OSCANASEL */
#define IFX_SCU_EVROSCCTRL_OSCANASEL_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVROSCCTRL_Bits.OSCANASEL */
#define IFX_SCU_EVROSCCTRL_OSCANASEL_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVROSCCTRL_Bits.OSCANASEL */
#define IFX_SCU_EVROSCCTRL_OSCANASEL_OFF (16)

/** \\brief  Length for Ifx_SCU_EVROSCCTRL_Bits.OSCPTAT */
#define IFX_SCU_EVROSCCTRL_OSCPTAT_LEN (6)

/** \\brief  Mask for Ifx_SCU_EVROSCCTRL_Bits.OSCPTAT */
#define IFX_SCU_EVROSCCTRL_OSCPTAT_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_EVROSCCTRL_Bits.OSCPTAT */
#define IFX_SCU_EVROSCCTRL_OSCPTAT_OFF (10)

/** \\brief  Length for Ifx_SCU_EVROSCCTRL_Bits.OSCTRIM */
#define IFX_SCU_EVROSCCTRL_OSCTRIM_LEN (10)

/** \\brief  Mask for Ifx_SCU_EVROSCCTRL_Bits.OSCTRIM */
#define IFX_SCU_EVROSCCTRL_OSCTRIM_MSK (0x3ff)

/** \\brief  Offset for Ifx_SCU_EVROSCCTRL_Bits.OSCTRIM */
#define IFX_SCU_EVROSCCTRL_OSCTRIM_OFF (0)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_OFF (0)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.EVR33OVVAL */
#define IFX_SCU_EVROVMON_EVR33OVVAL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.EVR33OVVAL */
#define IFX_SCU_EVROVMON_EVR33OVVAL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.EVR33OVVAL */
#define IFX_SCU_EVROVMON_EVR33OVVAL_OFF (8)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.LCK */
#define IFX_SCU_EVROVMON_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.LCK */
#define IFX_SCU_EVROVMON_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.LCK */
#define IFX_SCU_EVROVMON_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.SLCK */
#define IFX_SCU_EVROVMON_SLCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.SLCK */
#define IFX_SCU_EVROVMON_SLCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.SLCK */
#define IFX_SCU_EVROVMON_SLCK_OFF (30)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.SWDOVVAL */
#define IFX_SCU_EVROVMON_SWDOVVAL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.SWDOVVAL */
#define IFX_SCU_EVROVMON_SWDOVVAL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.SWDOVVAL */
#define IFX_SCU_EVROVMON_SWDOVVAL_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.BPRST13OFF */
#define IFX_SCU_EVRRSTCON_BPRST13OFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.BPRST13OFF */
#define IFX_SCU_EVRRSTCON_BPRST13OFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.BPRST13OFF */
#define IFX_SCU_EVRRSTCON_BPRST13OFF_OFF (25)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.BPRST33OFF */
#define IFX_SCU_EVRRSTCON_BPRST33OFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.BPRST33OFF */
#define IFX_SCU_EVRRSTCON_BPRST33OFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.BPRST33OFF */
#define IFX_SCU_EVRRSTCON_BPRST33OFF_OFF (27)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_SCU_EVRRSTCON_BPRSTSWDOFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_SCU_EVRRSTCON_BPRSTSWDOFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_SCU_EVRRSTCON_BPRSTSWDOFF_OFF (29)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.LCK */
#define IFX_SCU_EVRRSTCON_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.LCK */
#define IFX_SCU_EVRRSTCON_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.LCK */
#define IFX_SCU_EVRRSTCON_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.RST13OFF */
#define IFX_SCU_EVRRSTCON_RST13OFF_LEN (1)

